# Question 3

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
ed_df = pd.read_csv("data/educ_inc.csv", sep=",")
ed_df

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,1/1/08 0:00,00 to 17,Male,"College, less than 4-yr degree","C: 10,000 to 14,999",1304
1,1/1/08 0:00,00 to 17,Female,"College, less than 4-yr degree","B: 5,000 to 9,999",1565
2,1/1/08 0:00,65 to 80+,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,65 to 80+,Female,No high school diploma,"H: 75,000 and over",1981
4,1/1/08 0:00,00 to 17,Female,No high school diploma,"D: 15,000 to 24,999",2009
...,...,...,...,...,...,...
1021,1/1/14 0:00,18 to 64,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,18 to 64,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,18 to 64,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,18 to 64,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,18 to 64,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

In [6]:
ed_df.dtypes

Year                      object
Age                       object
Gender                    object
Educational Attainment    object
Personal Income           object
Population Count           int64
dtype: object

In [9]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
ed_df["Age"] = encoder.fit_transform(ed_df["Age"])

### Encoding age ranges:
### 0 -> 00 to 17
### 1 -> 18 to 64
### 2 -> 65 to 80+

In [10]:
ed_df

,Year,Age,Gender,Educational Attainment,Personal Income,Population Count
0,1/1/08 0:00,0,Male,"College, less than 4-yr degree","C: 10,000 to 14,999",1304
1,1/1/08 0:00,0,Female,"College, less than 4-yr degree","B: 5,000 to 9,999",1565
2,1/1/08 0:00,2,Male,"College, less than 4-yr degree","A: 0 to 4,999",1923
3,1/1/08 0:00,2,Female,No high school diploma,"H: 75,000 and over",1981
4,1/1/08 0:00,0,Female,No high school diploma,"D: 15,000 to 24,999",2009
...,...,...,...,...,...,...
1021,1/1/14 0:00,1,Female,High school or equivalent,"A: 0 to 4,999",670294
1022,1/1/14 0:00,1,Male,Bachelor's degree or higher,"G: 50,000 to 74,999",682425
1023,1/1/14 0:00,1,Female,No high school diploma,"A: 0 to 4,999",723208
1024,1/1/14 0:00,1,Female,Bachelor's degree or higher,"H: 75,000 and over",953282
1025,1/1/14 0:00,1,Male,Bachelor's degree or higher,"H: 75,000 and over",1628605

### 1.	Group the table by Educational Attainment and sum the Population Count in each category.

In [25]:
ed_df.groupby(by="Educational Attainment")["Population Count"].sum()

Educational Attainment
Bachelor's degree or higher       54617676
College, less than 4-yr degree    52137494
High school or equivalent         42942926
No high school diploma            40668871
Name: Population Count, dtype: int64

### 2.	Analyse the percentage distribution of educational attainment among adult Californians.

In [21]:
group_result = pd.DataFrame(ed_df[ed_df["Age"] >= 1].groupby(by="Educational Attainment")["Population Count"].sum())
group_result

                                Population Count
Educational Attainment
Bachelor's degree or higher             54603003
College, less than 4-yr degree          52045952
High school or equivalent               42828045
No high school diploma                  31102348

In [22]:
sum_ = group_result["Population Count"].sum()
sum_

180579348

In [24]:
group_result["Percentage"] = (group_result["Population Count"]/sum_) * 100
group_result

                                Population Count  Percentage
Educational Attainment
Bachelor's degree or higher             54603003   30.237679
College, less than 4-yr degree          52045952   28.821652
High school or equivalent               42828045   23.717023
No high school diploma                  31102348   17.223646